# SQL introduktion

I det här avsnittet kollar vi hur man kan hämta ut data ur vårt Data warehouse med hjälp av SQL.

För att kunna köra nedanstående SQL-frågor behöver du antingen logga in på BigQuery, eller öppna denna Jupyter notebook i Google colab och köra följande kod:

In [2]:
from google.colab import auth
auth.authenticate_user()
print('Authenticated')

Authenticated

Vi har tidigare tittat på hur vi kan använda Stitchdata för att periodvis replikera över data från vårt Google Analytics-konto samt vår CRM-databas till BigQuery. Nedan tittar vi på hur man kan söka i dessa, samt hur man kan slå ihop data från Google Analytics och CRM-databasen.

## Select

Låt oss ta en snabb titt på vår Google Analytics-data genom att köra select-satsen nedan:

In [3]:
%%bigquery --project surfsapp-8011b

SELECT * FROM `surfsapp-8011b.google_analytics.report` LIMIT 5

  dimension1  ... transactionrevenue
0     135468  ...                  0
1     135468  ...                  0
2     135468  ...                  0
3     135468  ...                  0
4     135468  ...                  0

[5 rows x 14 columns]

Med select väljer vi ut vilka kolumner vi är intresserade av. Vi kan se att Stitchdata har lagt till en del kolumner som börjar på _rjm och _sdc som Stitchdata använder internt för att synka över data. För att göra vår dataanalys är vi inte intresserade av dessa utan väljer enbart de kolumner som vi är intresserade av:

In [4]:
%%bigquery --project surfsapp-8011b

SELECT distinct
  dimension1,
  start_date,
  campaign,
  sourcemedium,
  sessions,
  transactions,
  pageviews,
  transactionrevenue
FROM `surfsapp-8011b.google_analytics.report` LIMIT 5

  dimension1                start_date  ... pageviews transactionrevenue
0     135468 2019-11-07 00:00:00+00:00  ...        11                  0
1     174528 2019-11-11 00:00:00+00:00  ...        19              30129
2     169987 2019-11-12 00:00:00+00:00  ...        17              25329
3     167096 2019-11-07 00:00:00+00:00  ...        25              45029
4     135598 2019-11-07 00:00:00+00:00  ...        29               4529

[5 rows x 8 columns]

I sökningen ovan har vi även lagt till *distinct* för att deduplicera resultaten. Anledningen till att vi behöver lägga till detta är att Stitchdata vid varje replikeringstillfälle tar med sig de senaste 15 dagarnas data och skickar denna till BigQuery och eftersom vi kör replikeringen var sjätte timma så kommer samma data att finnas på flera ställen i tabellen.

## Where

Med select väljer vi ut vilka kolumner vi vill läsa ut, men vill vi även specificera specifika rader som vi vill läsa ut så kan vi göra detta genom att lägga till en where-sats. Nedan tar vi bara med rader för ett specifikt datumintervall:

In [5]:
%%bigquery --project surfsapp-8011b

SELECT distinct
  dimension1,
  start_date,
  campaign,
  sourcemedium,
  sessions,
  transactions,
  pageviews,
  transactionrevenue
FROM `surfsapp-8011b.google_analytics.report` 
where start_date between '2019-11-06' and '2019-11-13' LIMIT 5

  dimension1                start_date  ... pageviews transactionrevenue
0     174189 2019-11-12 00:00:00+00:00  ...        15                  0
1     174385 2019-11-12 00:00:00+00:00  ...         7                  0
2     174760 2019-11-12 00:00:00+00:00  ...        11                  0
3     175575 2019-11-12 00:00:00+00:00  ...        11                  0
4     175908 2019-11-12 00:00:00+00:00  ...        15                  0

[5 rows x 8 columns]

## Join

Det går som sagt att använda SQL, inte bara till att söka i data i en tabell, utan också för att kombinera och hämta ut data från flera tabeller.

Det som krävs för att man skall kunna slå ihop tabeller med hjälp av en join-sats är att det finns någon gemensam nyckel i båda tabellerna. I vår Google Analytics data ovan har vi t.ex. nyckeln *dimension1* som innehåller vårt user id. Tittar vi på vår CRM-data så kan vi se att vi motsvarande user id i en kolumn som heter *CustomerID*:

In [6]:
%%bigquery --project surfsapp-8011b

SELECT * FROM `surfsapp-8011b.nop_database.customer_data` LIMIT 5

   CustomerID Gender DateOfBirth ZipPostalCode
0      139509      F  1959-08-03         20800
1      134478      M  1972-08-03         20800
2      137665      M  1977-08-03         11000
3      132153      F  1980-08-03         11000
4      131434      M  1988-08-03         40010

Om vi vill utöka vår GA-data med data om Gender, DateOfBirth, och ZipPostalCode från vårt CRM-system så kan vi göra det genom att utgå från vår GA-data och göra en left join med vår CRM-data där dimension1 i vår GA-data matchar CustomerID i vår CRM-data.

In [7]:
%%bigquery --project surfsapp-8011b

SELECT *
FROM `surfsapp-8011b.google_analytics.ga_report` ga 
LEFT JOIN `surfsapp-8011b.nop_database.customer_data` crm ON ga.dimension1=CAST(crm.CustomerID AS string) LIMIT 5

  dimension1                start_date  ... DateOfBirth ZipPostalCode
0     135468 2019-11-07 00:00:00+00:00  ...  1959-08-03         11000
1     174528 2019-11-11 00:00:00+00:00  ...  1968-08-03         20800
2     169987 2019-11-12 00:00:00+00:00  ...  1973-08-03         40010
3     167096 2019-11-07 00:00:00+00:00  ...  1970-08-03         20800
4     135598 2019-11-07 00:00:00+00:00  ...  1959-08-03         11000

[5 rows x 12 columns]

Med left join behåller vi vår GA-data som den är och lägger till CRM-data på de rader där vi hittar ett matchande user-id i vår CRM-data. Hade vi istället gjort en inner join hade vi enbart tagit med user-id som finns i både vår GA-data och vår CRM-data och läst in data för dessa. Det går också att göra en outer join där vi tar med alla user-id som finns antingen i vår GA-data eller i vår CRM-data och hämtar den data vi har tillgänglig för detta ur respektive tabell...

## Group by

Vi kan också använda SQL för att aggregera data med hjälp av group by:

In [8]:
%%bigquery --project surfsapp-8011b

SELECT
  campaign,
  count(DISTINCT CustomerID) AS unique_userids,
  sum(sessions) AS sessions,
  sum(transactions) AS transactions,
  sum(transactionrevenue) AS revenue
FROM `surfsapp-8011b.google_analytics.ga_report` ga 
LEFT JOIN `surfsapp-8011b.nop_database.customer_data` crm ON ga.dimension1=CAST(crm.CustomerID AS string)
GROUP BY campaign

          campaign  unique_userids  sessions  transactions  revenue
0        (not set)             947      2115           524  9789796
1     black_friday             428       842           287  5975023
2   superdupersale             335       789           291  6332439
3  winter_getaways              48        54             7    52803
4     cyber_monday             272       351            35   390815

# Having

Slutligen kan vi även filtrera rader baserad på aggregerad information med having:

In [9]:
%%bigquery --project surfsapp-8011b

SELECT
  campaign,
  count(DISTINCT CustomerID) AS unique_userids,
  sum(sessions) AS sessions,
  sum(transactions) AS transactions,
  sum(transactionrevenue) AS revenue
FROM `surfsapp-8011b.google_analytics.ga_report` ga 
LEFT JOIN `surfsapp-8011b.nop_database.customer_data` crm ON ga.dimension1=CAST(crm.CustomerID AS string)
GROUP BY campaign
HAVING revenue>100000

         campaign  unique_userids  sessions  transactions  revenue
0       (not set)             947      2115           524  9789796
1    cyber_monday             272       351            35   390815
2  superdupersale             335       789           291  6332439
3    black_friday             428       842           287  5975023